CompositeApplication/test/TestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://j2ee.netbeans.org/wsdl/newWSDL">
  <soapenv:Body>
    <new:newWSDLOperation>
      <id1>1</id1>
      <id2>1</id2>
    </new:newWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>